doc/composite_dev_manual.org
* _Composite_ Developer Manual v0.1 by Gabriel Parmer (=gparmer@gwu.edu=)
  
  _Composite_ is in a constant state of flux.  This manual might be out
  of date.  Specific functions might not exist -- or might have
  changed, but the ideas will probably map across versions.  Please
  see the other files in the doc/ directory for the specifics
  regarding which files to create and modify to make a component or
  interface, how the build system is set up, what the directory
  structure is, how to execute the system, or how to debug.  This file
  should *only* be used once you understand these documents, and want
  to sit down and program!

  - Document Organization: This document is separated into three
    general sections: 
    1) Library functions that you can use in your program.  Note that
       they might not be as functional as their libc equivalents.
    2) The basic components that make up the current _Composite_
       ecosystem.  These provide basic services, and can be used by
       your component.
    3) _Composite_ kernel system calls.  These are not typically used
       in many programs, and are instead abstracted either by a
       library or another component.  However, for lower-level
       programming, or to understand existing code, we document the
       system call layer.
  - Please keep in mind that this documentation was written quickly
    (as it always is), so /any documentation bug-fixes would be
    appreciated/, and that /this documentation is not meant to be a
    replacement for code inspection/.  This documentation provides
    high-level context so that you can see a little better how things
    fit together.  Use the information in here, to grep through the
    source code to find examples of how the different APIs are used,
    and how these APIs are implemented.
  
** Component Library Functions

   - =long cos\_spd\_id(void)= - retrieve the current spd identifier
     (i.e. component id).
   - =long cos\_get\_thd\_id(void)= - retrieve the current thread
     identifier
   - =void *cos\_get\_heap\_ptr(void)= - this should not be commonly
     used and is instead used internally by the heap management
     functions (malloc/free/get_free_page)
   - =void cos\_set\_heap\_ptr(void *addr)= - mutator for the pointer
     to the end of the heap.  Again, this is not commonly used in
     component code.
   - =long cos\_cmpxchg(volatile void *memory, long
                        anticipated, long result)= - A uni-processor
     compare and exchange implementation using restartable atomic
     sequences.  The memory location (=memory=), if set to
     =anticipated= is changed to =result=, atomically.  It returns the
     value of the memory after the atomic operation.

   - =void *cos\_argreg\_alloc(int sz)= - Currently, to pass arguments
     to other components, the "argument region" must be used.  This is
     essentially a page that travels with a thread as it executes
     between multiple components.  This function is used to allocate a
     region of size =sz= in that region.  Often, one will want to
     allocate the size of the data you want to pass plus
     =sizeof(struct cos\_array)= (see below).  This results in a
     bounded array.
   - =int cos\_argreg\_free(void *p)= - Frees an "argument region"
     allocation.  The argument region must be allocated from and freed
     from as a stack.  If multiple allocations are made, they must be
     freed in the reverse order that they are allocated.
   - =int cos\_argreg\_arr\_intern(struct cos\_array *ca)=

     =struct cos\_array {=
	=int sz;=
	=char mem[0];=
     =};= - This function returns true or false depending on if the
        =struct cos\_array= is allocated from within the "argument
        region".

   - =void *malloc(int sz)= - A malloc implementation that is
     thread-safe, but does _not_ handle allocations larger than a
     page.  There is not a technical limitation preventing allocations
     larger than a page, but a more intelligent allocator must be
     implemented.
   - =void *alloc_page(void)=, =void free_page(void *ptr)= - allocate
     and free a single page.

     
** Component <-> Component Interface:
  
   Components communicate with each other via invocations.  A
   component that is dependent on the other can make an invocation of
   a function in the exported interface of the other component.  That
   is to say, components can call functions exported in the interface
   for other components.  Here we discuss the foundational components
   that provide essential services in _Composite_.  We go from the
   higher-level ones most likely to be used, to the lower-level ones
   that provide more primitive services.  The interfaces for each of
   these components can be seen in the =.h= files in the
   subdirectories of =src/components/interface/=.

   A general pattern for many components is that the component
   provides some abstraction or object whose functionality can be
   harnessed via the component's API.  To create such an object
   (e.g. a lock, an event, a network connection, all of which we will
   call resources), or release one, many component interfaces provide
   the following functions
   + =open=, =create=, or =alloc= to create the resource, and return
     an integer identifier for it (similar to a file-descriptor, and
   + =close=, =release=, or =free= to release it.  In the future,
   these names should be unified to say =create= and =release=.
   =release= is more appropriate than =free= as the resources are
   often reference counted.

   Once a resource is allocated, it can be operated on.  The API for
   this is different for each component.  For the lock component, for
   example, one can =take= and =release= the lock, and for the event
   component, one can =trigger= the event, or =wait= on an event.

   This style of API is a consistent theme in _Composite_, however it
   is not universal.

*** Requesting Memory, and Printing

    The component interface for getting memory is =mem\_mgr=, and for
    printing, =printc=.  These should most often be used indirectly
    through the library calls for =malloc= / =free= and =printf=.

