doc/composite_dev_manual.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>composite<sub>dev</sub><sub>manual</sub></title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-01-29 18:34:22 EST"/>
<meta name="author" content="Gabriel Parmer"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">composite<sub>dev</sub><sub>manual</sub></h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 <span style="text-decoration:underline;">Composite</span> Developer Manual v0.1 by Gabriel Parmer (<code>gparmer@gwu.edu</code>) </a>
<ul>
<li><a href="#sec-1.1">1.1 Component Library Functions </a></li>
<li><a href="#sec-1.2">1.2 Component &lt;-&gt; Component Interface: </a>
<ul>
<li><a href="#sec-1.2.1">1.2.1 Requesting Memory, and Printing </a></li>
<li><a href="#sec-1.2.2">1.2.2 Locking </a></li>
<li><a href="#sec-1.2.3">1.2.3 Event notification </a></li>
<li><a href="#sec-1.2.4">1.2.4 Networking </a></li>
<li><a href="#sec-1.2.5">1.2.5 Time management </a></li>
<li><a href="#sec-1.2.6">1.2.6 Scheduling </a></li>
</ul>
</li>
<li><a href="#sec-1.3">1.3 Component &lt;-&gt; Kernel Interface: </a>
<ul>
<li><a href="#sec-1.3.1">1.3.1 Functions for creating and manipulating components and capabilities </a></li>
<li><a href="#sec-1.3.2">1.3.2 Scheduler functions </a></li>
<li><a href="#sec-1.3.3">1.3.3 Brand management and execution functions </a></li>
<li><a href="#sec-1.3.4">1.3.4 Mutable protection domains management </a></li>
<li><a href="#sec-1.3.5">1.3.5 Virtual memory management </a></li>
<li><a href="#sec-1.3.6">1.3.6 Other functions </a></li>
<li><a href="#sec-1.3.7">1.3.7 Future <span style="text-decoration:underline;">Composite</span> functionality </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <span style="text-decoration:underline;">Composite</span> Developer Manual v0.1 by Gabriel Parmer (<code>gparmer@gwu.edu</code>) </h2>
<div class="outline-text-2" id="text-1">


<p>
<span style="text-decoration:underline;">Composite</span> is in a constant state of flux.  This manual might be out
of date.  Specific functions might not exist &ndash; or might have
changed, but the ideas will probably map across versions.  Please
see the other files in the doc/ directory for the specifics
regarding which files to create and modify to make a component or
interface, how the build system is set up, what the directory
structure is, how to execute the system, or how to debug.  This file
should <b>only</b> be used once you understand these documents, and want
to sit down and program!
</p>
<ul>
<li>
Document Organization: This document is separated into three
general sections: 
<ol>
<li>
Library functions that you can use in your program.  Note that
they might not be as functional as their libc equivalents.
</li>
<li>
The basic components that make up the current <span style="text-decoration:underline;">Composite</span>
ecosystem.  These provide basic services, and can be used by
your component.
</li>
<li>
<span style="text-decoration:underline;">Composite</span> kernel system calls.  These are not typically used
in many programs, and are instead abstracted either by a
library or another component.  However, for lower-level
programming, or to understand existing code, we document the
system call layer.
</li>
</ol>
</li>
<li>
Please keep in mind that this documentation was written quickly
(as it always is), so <i>any documentation bug-fixes would be     appreciated</i>, and that <i>this documentation is not meant to be a     replacement for code inspection</i>.  This documentation provides
high-level context so that you can see a little better how things
fit together.  Use the information in here, to grep through the
source code to find examples of how the different APIs are used,
and how these APIs are implemented.

</li>
</ul>

</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Component Library Functions </h3>
<div class="outline-text-3" id="text-1.1">


<ul>
<li>
<code>long cos_spd_id(void)</code> - retrieve the current spd identifier
(i.e. component id).
</li>
<li>
<code>long cos_get_thd_id(void)</code> - retrieve the current thread
identifier
</li>
<li>
<code>void *cos_get_heap_ptr(void)</code> - this should not be commonly
used and is instead used internally by the heap management
functions (malloc/free/get<sub>free</sub><sub>page</sub>)
</li>
<li>
<code>void cos_set_heap_ptr(void *addr)</code> - mutator for the pointer
to the end of the heap.  Again, this is not commonly used in
component code.
</li>
<li>
<code>long cos_cmpxchg(volatile void *memory, long                         anticipated, long result)</code> - A uni-processor
compare and exchange implementation using restartable atomic
sequences.  The memory location (<code>memory</code>), if set to
<code>anticipated</code> is changed to <code>result</code>, atomically.  It returns the
value of the memory after the atomic operation.

</li>
<li>
<code>void *cos_argreg_alloc(int sz)</code> - Currently, to pass arguments
to other components, the "argument region" must be used.  This is
essentially a page that travels with a thread as it executes
between multiple components.  This function is used to allocate a
region of size <code>sz</code> in that region.  Often, one will want to
allocate the size of the data you want to pass plus
<code>sizeof(struct cos_array)</code> (see below).  This results in a
bounded array.
</li>
<li>
<code>int cos_argreg_free(void *p)</code> - Frees an "argument region"
allocation.  The argument region must be allocated from and freed
from as a stack.  If multiple allocations are made, they must be
freed in the reverse order that they are allocated.
</li>
<li>
<code>int cos_argreg_arr_intern(struct cos_array *ca)</code>

<p>
<code>struct cos_array {</code>
<code>int sz;</code>
<code>char mem[0];</code>
<code>};</code> - This function returns true or false depending on if the
<code>struct cos_array</code> is allocated from within the "argument
region".
</p>
</li>
<li>
<code>void *malloc(int sz)</code> - A malloc implementation that is
thread-safe, but does <span style="text-decoration:underline;">not</span> handle allocations larger than a
page.  There is not a technical limitation preventing allocations
larger than a page, but a more intelligent allocator must be
implemented.
</li>
<li>
<code>void *alloc_page(void)</code>, <code>void free_page(void *ptr)</code> - allocate
and free a single page.


</li>
</ul>
</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> Component &lt;-&gt; Component Interface: </h3>
<div class="outline-text-3" id="text-1.2">


<p>
Components communicate with each other via invocations.  A
component that is dependent on the other can make an invocation of
a function in the exported interface of the other component.  That
is to say, components can call functions exported in the interface
for other components.  Here we discuss the foundational components
that provide essential services in <span style="text-decoration:underline;">Composite</span>.  We go from the
higher-level ones most likely to be used, to the lower-level ones
that provide more primitive services.  The interfaces for each of
these components can be seen in the <code>.h</code> files in the
subdirectories of <code>src/components/interface/</code>.
</p>
<p>
A general pattern for many components is that the component
provides some abstraction or object whose functionality can be
harnessed via the component's API.  To create such an object
(e.g. a lock, an event, a network connection, all of which we will
call resources), or release one, many component interfaces provide
the following functions
</p><ul>
<li>
<code>open</code>, <code>create</code>, or <code>alloc</code> to create the resource, and return
an integer identifier for it (similar to a file-descriptor, and
</li>
<li>
<code>close</code>, <code>release</code>, or <code>free</code> to release it.  In the future,
</li>
</ul>

<p>these names should be unified to say <code>create</code> and <code>release</code>.
<code>release</code> is more appropriate than <code>free</code> as the resources are
often reference counted.
</p>
<p>
Once a resource is allocated, it can be operated on.  The API for
this is different for each component.  For the lock component, for
example, one can <code>take</code> and <code>release</code> the lock, and for the event
component, one can <code>trigger</code> the event, or <code>wait</code> on an event.
</p>
<p>
This style of API is a consistent theme in <span style="text-decoration:underline;">Composite</span>, however it
is not universal.
</p>

</div>

<div id="outline-container-1.2.1" class="outline-4">
<h4 id="sec-1.2.1"><span class="section-number-4">1.2.1</span> Requesting Memory, and Printing </h4>
<div class="outline-text-4" id="text-1.2.1">


<p>
The component interface for getting memory is <code>mem_mgr</code>, and for
printing, <code>printc</code>.  These should most often be used indirectly
through the library calls for <code>malloc</code> / <code>free</code> and <code>printf</code>.
</p>
</div>

</div>
