doc/composite_dev_manual.html

<div id="outline-container-1.2.2" class="outline-4">
<h4 id="sec-1.2.2"><span class="section-number-4">1.2.2</span> Locking </h4>
<div class="outline-text-4" id="text-1.2.2">

<p>The interface specification for the lock component is in
<code>src/components/interface/lock/lock.h</code> and
<code>src/components/include/cos_synchronization.h</code>.  The lock
component is an odd one in that some functionality is loaded (via
cos<sub>synchronization</sub>.c) into the client component.  This enables
the "fast path" of taking and releasing locks when there is no
contention to be fast.
</p>
<p>
The lock API (the one the library exposes) includes
</p><ul>
<li>
<code>lock_static_init(cos_lock_t)</code> which initializes a lock that
is statically allocated (and calls <code>lock_component_alloc</code>).
</li>
<li>
<code>lock__release(cos_lock_t)</code> which will release the lock in
the lock component.

</li>
</ul>

<p>Once a lock is created, one can simply <code>lock_take(cos_lock_t)</code>
and <code>lock_release(cos_lock_t)</code> to take and release the lock (up
and down a semaphore) to provide a critical section.
</p>
</div>

</div>

<div id="outline-container-1.2.3" class="outline-4">
<h4 id="sec-1.2.3"><span class="section-number-4">1.2.3</span> Event notification </h4>
<div class="outline-text-4" id="text-1.2.3">


<p>
Often a thread will want to wait for an event to happen in another
component.  This can vary from waiting for a packet to arrive in a
networking component, or waiting for data to arrive on an
asynchronous IPC channel.  This drives the need for the <code>select</code>
and <code>poll</code> system calls in UNIX.  In general there are two
components, one with a thread that wishes to wait for a number
(multiple) events, and the other component that can trigger
events. The event notification component provides this
functionality.
</p>
<p>
The API for the event notification component can be found in
<code>src/components/interface/evt/evt.h</code>.  We'll discuss a subset of
the API.  As with the lock component, there are <code>evt_create</code> and
<code>evt_free</code> to create and remove an event.  Each event is
referenced by a <code>long</code> value.  The component that will wait for
the event usually creates the event, and passes the event
identifier to the component that will trigger the event.
</p>
<p>
The component in which the event is detected (because an interrupt
delivers a packet) will call <code>evt_trigger</code> to "trigger" the
event.  At this point, any threads waiting on that event will wake
up and be notified of the event's activity.  
</p>
<p>
The component executing the thread that wishes to wait for the
event will call <code>evt_wait</code> to wait (block) waiting for any of its
events to be triggered.  It will wait on <i>all</i> of the events that
have been created by this thread.  The API might be changed in the
future to allow the user to change which set of events to wait
on.  Though the API allows one to prioritize events, we do not
discuss that API here.
</p>
</div>

</div>

<div id="outline-container-1.2.4" class="outline-4">
<h4 id="sec-1.2.4"><span class="section-number-4">1.2.4</span> Networking </h4>
<div class="outline-text-4" id="text-1.2.4">

<p><span style="text-decoration:underline;">Composite</span> includes the LWIP networking stack as a component.
The API is distinctly lower-level than the socket API, but
facilities are provided to send and receive packets.  The API
should support both TCP and UDP, but we haven't tested the UDP in
a couple of years.  It is doubtful it works.  The API can be
viewed in
<code>src/components/interface/net_transport/net_transport.h</code>.
</p>
<p>
To create a connection, one has three options:
</p><ul>
<li>
<code>net_connection_t net_create_tcp_connection(spdid_t spdid, u16_t tid, long evt_id);</code>
</li>
<li>
<code>net_connection_t net_create_udp_connection(spdid_t spdid, long evt_id);</code>
</li>
<li>
<code>net_connection_t net_accept(spdid_t spdid, net_connection_t nc);</code>

</li>
</ul>

<p>As always, the <code>net_connection_t</code> is just an integer
identifying the connection.  When creating a TCP connection, one
passes in the thread id of the thread that can manipulate that
connection.  This restriction will likely be lifted in the future,
but for now, it must be passed in.  The accept call is similar to
the similarly named call in UNIX.  The network connection
identified by <code>nc</code> will wait for connection requests, and create a
new connection identified by the returned connection.  This call
is asynchronous, which means that a thread that calls it will not
block waiting for the connection to be made.  If another
connection cannot be made immediately, it will return <code>-EAGAIN</code>.
</p>
<p>
The event id passed into these calls is the event that is to be
triggered when an event happens on this connection.
</p>
<p>
A <code>close</code> call will close the connection.
</p>
<p>
To build a TCP connection, as in UNIX, one must <code>listen</code>, <code>bind</code>,
and possibly <code>connect</code> the connection.  The connect call is an
outlier in <span style="text-decoration:underline;">Composite</span> interface functions in that it will block
until the actual connection is created.  This should be changed in
the future.
</p>
<p>
To actually use the connection by retrieving and sending data, one
uses <code>net_send</code> and <code>net_recv</code>.   The <code>data</code> argument must be in
the argument region (see the library functions above).  These are,
again, asynchronous, so threads will not block on them if there is
no data, or buffer space.  Instead <code>-EAGAIN</code> will be called.
</p>
</div>

</div>

<div id="outline-container-1.2.5" class="outline-4">
<h4 id="sec-1.2.5"><span class="section-number-4">1.2.5</span> Time management </h4>
<div class="outline-text-4" id="text-1.2.5">


<p>
Two components provide the ability to keep time, and block waiting
for certain amounts of time to elapse.  The simpler of the two is
<code>timed_blk</code> (<code>src/components/interface/timed_blk/timed_blk.h</code>).
Simply, one can call <code>timed_event_block</code> and pass in the amount of
time (in jiffies) one wishes to block.  The return value is the
amount of time spent blocked.  You'll be waked up no sooner than
at the end of that period.  The second function is
<code>timed_event_wakeup</code> which can be used to prematurely wake up
the thread specified as an argument.
</p>
<p>
The more complicated time keeping component (actually usually
provided by the same component) is the periodic timer, provided by
<code>src/components/interface/periodic_wake/periodic_wake.h</code>.  This
API generally allows a thread to be woken up periodically.  The
thread creates a periodic timer using <code>periodic_wake_create</code>
which specifies the periodicity of the timer in jiffies.  This
timer can be deleted using <code>periodic_wake_remove</code>.
<code>periodic_wake_wait</code> will cause the thread to block waiting for
a periodic event.  It will be woken up either immediately if that
event has triggered and this thread didn't wait on it before it
triggered, or when the periodic amount of time passes.  Other
functions in the API provide information about deadline misses,
lateness, etc&hellip;
</p>
</div>

</div>

<div id="outline-container-1.2.6" class="outline-4">
<h4 id="sec-1.2.6"><span class="section-number-4">1.2.6</span> Scheduling </h4>
<div class="outline-text-4" id="text-1.2.6">


<p>
This API should hopefully not be needed/used that often.  Most
timing, blocking, and critical section services are provided by
the time management components, the event notification component,
and the locking components, respectively, described above.  The
<code>sched</code> interface (<code>src/components/interface/sched/sched.h</code>)
contains many functions.  I will assume that the previous
components are used, and will describe functions in the scheduler
API that provide orthogonal functionality.  These boil down to:
</p>
<ul>
<li>
<code>unsigned int sched_tick_freq(void);</code> - Get the number of
jiffies in a second.
</li>
<li>
<code>int sched_create_thread(spdid_t spdid, struct cos_array       *data);</code> - Create a new thread.  The <code>data</code> argument is an array
in the argument region (see library functions above) that
contains a textual representation of the priority of the created
thread.


</li>
</ul>
</div>
</div>

</div>
