doc/composite_dev_manual.org
*** Scheduler functions
Only a scheduler can actually usefully use these functions.  

    - =int create\_thread(int a, int b, int c);= 
      * Create a new thread with a thread id returned by this
        syscall.  Its initial registers (=bx=, =di=, and =si=) are set
        to =a=, =b=, and =c=.  It will begin executing in the
        component that invokes this syscall.
    - =int upcall(int spd\_id);=
      * The current thread will terminate execution in this component,
        and will make an upcall into component =spd\_id=.
    - =int sched\_cntl(int operation, int thd\_id, long option);=
      * =operation= determines the function of the syscall:
	+ =COS\_SCHED\_EVT\_REGION=: Set the event region
          (page-aligned) within the calling scheduler to the address
          =option=.
	+ =COS\_SCHED\_THD\_EVT=: Associate a specific entry (number
          =option=) in the event region for the calling scheduler to
          the thread =thd\_id=.
	+ =COS\_SCHED\_PROMOTE\_CHLD=: Set the component specified in
          =option= to be a child scheduler under the current
          scheduler.  Errors if the component already has a parent, or
          if the maximum hierarchy depth has been reached.
	+ =COS\_SCHED\_GRANT\_SCHED=: Grant access of the child
          scheduler =option= to schedule the thread =thd\_id=.  That
          thread must be schedulable by the current scheduler.  The
          root scheduler is automatically granted schedulability of
          all threads.
	+ =COS\_SCHED\_REVOKE\_SCHED=: Remove previously granted
          scheduling permission of thread =thd\_id= to child scheduler
          =option=.
	+ =COS\_SCHED\_BREAK\_PREEMPTION\_CHAIN=: Complicated.  Default
          brand activation specifies that if the thread executing on
          the brand's behalf waits for the next event, the system will
          automatically switch back to the preempted thread.  That is
          not always what you want (i.e. if a thread was woken up with
          a higher priority than the preempted thread).  This call
          will prevent the automatic switch to the preempted thread.
          Instead, the scheduler will be upcalled.
    - =int cos\_thd\_cntl(short int op, short int thd\_id,
                          long arg1, long arg2);=
      * =op= defines the specific behavior of this system call.  Most
        functionality is for accessing thread register or execution
        state.  General introspection facilities.
	+ =COS\_THD\_INV\_FRAME=: retrieve the invoked component for
          thread =thd\_id= at the =arg1= th position in its invocation
          frame.
	+ =COS\_THD\_INVFRM\_IP=, =COS\_THD\_INVFRM\_SP=, and
          =COS\_THD\_INVFRM\_FP=: retrieve a preempted thread,
          =thd\_id='s instruction pointer and stack pointer of the
          invocation at position =arg1= in its invocation frame.
	+ =COS\_THD\_GET\_IP=, =COS\_THD\_GET\_SP=: Get the
          instruction pointer and stack
          pointer from a preempted thread =thd\_id=.  Return =0= if
          the thread is not preempted.
	+ =COS\_THD\_SET\_IP=: Set the instruction pointer for thread
          =thd\_id= to =arg1=.
	+ =COS\_THD\_STATUS=: return the status flags of thread
          =thd\_id=.
    - =int cos\_switch\_thread(unsigned short int thd\_id, unsigned
      short int flags);=
      * Only a scheduler can invoke this system call.  Additionally,
        the scheduler must have been granted scheduling permission to
        schedule the current thread and =thd\_id=.  The specific
        behavior of this system call are dependent on the =flags=
        passed to it.
	+ =0=: This is the common case.  The intention is to switch
          from the current thread to =thd\_id=.  If that thread has
          been preempted, then this might involve switching between
          components.
	+ =COS\_SCHED\_SYNC\_BLOCK= and =COS\_SCHED\_SYNC\_UNBLOCK=:
          This is the wait-free synchronization primitive provided by
          the _Composite_ kernel.  =BLOCK= means that the current
          thread is attempting to take the scheduler critical section,
          and the kernel should switch immediately to the thread
          holding the critical section.  =UNBLOCK= is called by that
          thread that just released the critical section (CS), and will
          immediately switch to the thread waiting for the CS.
	+ =COS\_SCHED\_CHILD\_EVT=: Used for hierarchical scheduling.
          When switching to the child scheduler's event thread, this
          flag is used to set the =pending\_cevt= flag in the child
          scheduler.  This is used to avoid race conditions, and
          ensures that the child scheduler knows of this event.
	+ =COS\_SCHED\_TAILCALL=: When a brand is activated and its
          corresponding thread executes, then finishes, it can upcall
          into the scheduler -- a notification of it finishing.  We
          want that thread to go back to waiting for additional brand
          activations, but it must also switch to another thread that
          can make progress.  This flag carries out this process.  1)
          switch to =thd\_id=, and 2) set the current thread to
          waiting for brand activations again (or execute one
          immediately if some are pending).
	+ =COS\_SCHED\_BRAND\_WAIT=: Only called by the timer tick
          thread.  This is equivalent to the timer saying "I'm done,
          and wait to wait for the next brand activation...but please
          switch to =thd\_id=".  This call and =TAILCALL= are
          encapsulated in =cos_sched_base.c=, so you shouldn't have to
          worry about them...unless you're hacking the scheduler.
    - =int idle(void);=: Idle the system until an event arrives.  This
      can mean many things in a hijacked environment.

