doc/composite_dev_manual.html

<div id="outline-container-1.3.2" class="outline-4">
<h4 id="sec-1.3.2"><span class="section-number-4">1.3.2</span> Scheduler functions </h4>
<div class="outline-text-4" id="text-1.3.2">

<p>Only a scheduler can actually usefully use these functions.  
</p>
<ul>
<li>
<code>int create_thread(int a, int b, int c);</code> 
<ul>
<li>
Create a new thread with a thread id returned by this
syscall.  Its initial registers (<code>bx</code>, <code>di</code>, and <code>si</code>) are set
to <code>a</code>, <code>b</code>, and <code>c</code>.  It will begin executing in the
component that invokes this syscall.
</li>
</ul>
</li>
<li>
<code>int upcall(int spd_id);</code>
<ul>
<li>
The current thread will terminate execution in this component,
and will make an upcall into component <code>spd_id</code>.
</li>
</ul>
</li>
<li>
<code>int sched_cntl(int operation, int thd_id, long option);</code>
<ul>
<li>
<code>operation</code> determines the function of the syscall:
<ul>
<li>
<code>COS_SCHED_EVT_REGION</code>: Set the event region
(page-aligned) within the calling scheduler to the address
<code>option</code>.
</li>
<li>
<code>COS_SCHED_THD_EVT</code>: Associate a specific entry (number
<code>option</code>) in the event region for the calling scheduler to
the thread <code>thd_id</code>.
</li>
<li>
<code>COS_SCHED_PROMOTE_CHLD</code>: Set the component specified in
<code>option</code> to be a child scheduler under the current
scheduler.  Errors if the component already has a parent, or
if the maximum hierarchy depth has been reached.
</li>
<li>
<code>COS_SCHED_GRANT_SCHED</code>: Grant access of the child
scheduler <code>option</code> to schedule the thread <code>thd_id</code>.  That
thread must be schedulable by the current scheduler.  The
root scheduler is automatically granted schedulability of
all threads.
</li>
<li>
<code>COS_SCHED_REVOKE_SCHED</code>: Remove previously granted
scheduling permission of thread <code>thd_id</code> to child scheduler
<code>option</code>.
</li>
<li>
<code>COS_SCHED_BREAK_PREEMPTION_CHAIN</code>: Complicated.  Default
brand activation specifies that if the thread executing on
the brand's behalf waits for the next event, the system will
automatically switch back to the preempted thread.  That is
not always what you want (i.e. if a thread was woken up with
a higher priority than the preempted thread).  This call
will prevent the automatic switch to the preempted thread.
Instead, the scheduler will be upcalled.
</li>
</ul>
</li>
</ul>
</li>
<li>
<code>int cos_thd_cntl(short int op, short int thd_id,                           long arg1, long arg2);</code>
<ul>
<li>
<code>op</code> defines the specific behavior of this system call.  Most
functionality is for accessing thread register or execution
state.  General introspection facilities.
<ul>
<li>
<code>COS_THD_INV_FRAME</code>: retrieve the invoked component for
thread <code>thd_id</code> at the <code>arg1</code> th position in its invocation
frame.
</li>
<li>
<code>COS_THD_INVFRM_IP</code>, <code>COS_THD_INVFRM_SP</code>: retrieve a
preempted thread, <code>thd_id</code>'s instruction pointer and stack
pointer of the invocation at position <code>arg1</code> in its
invocation frame.
</li>
<li>
<code>COS_THD_GET_XX</code>, where <code>XX</code> is <code>{IP, SP, FP, 1, 2, 3, 4,           5, 6}</code>: Get the instruction pointer, stack pointer, frame
pointer, or one of the 6 general purpose registers from a
preempted thread <code>thd_id</code>.  Return <code>0</code> if the thread is not
preempted.  If <code>arg1</code> is <code>1</code>, it will access the fault
registers.
</li>
<li>
<code>COS_THD_SET_XX</code>: Where <code>XX</code> is defined above.  Set the
register for a preempted thread, <code>thd_id</code>, to <code>arg1</code> if
<code>arg2</code> is 0, and for the fault registers if <code>arg2</code> is 1.
</li>
<li>
<code>COS_THD_STATUS</code>: return the status flags of thread
<code>thd_id</code>.
</li>
</ul>
</li>
</ul>
</li>
<li>
<code>int cos_switch_thread(unsigned short int thd_id, unsigned       short int flags);</code>
<ul>
<li>
Only a scheduler can invoke this system call.  Additionally,
the scheduler must have been granted scheduling permission to
schedule the current thread and <code>thd_id</code>.  The specific
behavior of this system call are dependent on the <code>flags</code>
passed to it.
<ul>
<li>
<code>0</code>: This is the common case.  The intention is to switch
from the current thread to <code>thd_id</code>.  If that thread has
been preempted, then this might involve switching between
components.
</li>
<li>
<code>COS_SCHED_SYNC_BLOCK</code> and <code>COS_SCHED_SYNC_UNBLOCK</code>:
This is the wait-free synchronization primitive provided by
the <span style="text-decoration:underline;">Composite</span> kernel.  <code>BLOCK</code> means that the current
thread is attempting to take the scheduler critical section,
and the kernel should switch immediately to the thread
holding the critical section.  <code>UNBLOCK</code> is called by that
thread that just released the critical section (CS), and will
immediately switch to the thread waiting for the CS.
</li>
<li>
<code>COS_SCHED_CHILD_EVT</code>: Used for hierarchical scheduling.
When switching to the child scheduler's event thread, this
flag is used to set the <code>pending_cevt</code> flag in the child
scheduler.  This is used to avoid race conditions, and
ensures that the child scheduler knows of this event.
</li>
<li>
<code>COS_SCHED_TAILCALL</code>: When a brand is activated and its
corresponding thread executes, then finishes, it can upcall
into the scheduler &ndash; a notification of it finishing.  We
want that thread to go back to waiting for additional brand
activations, but it must also switch to another thread that
can make progress.  This flag carries out this process.  1)
switch to <code>thd_id</code>, and 2) set the current thread to
waiting for brand activations again (or execute one
immediately if some are pending).
</li>
<li>
<code>COS_SCHED_BRAND_WAIT</code>: Only called by the timer tick
thread.  This is equivalent to the timer saying "I'm done,
and wait to wait for the next brand activation&hellip;but please
switch to <code>thd_id</code>".  This call and <code>TAILCALL</code> are
encapsulated in <code>cos_sched_base.c</code>, so you shouldn't have to
worry about them&hellip;unless you're hacking the scheduler.
</li>
</ul>
</li>
</ul>
</li>
<li>
<code>int idle(void);</code>: Idle the system until an event arrives.  This
can mean many things in a hijacked environment.

</li>
</ul>
</div>

</div>
