doc/composite_dev_manual.org
*** Brand management and execution functions

    - =int cos\_brand\_cntl(int ops, unsigned short int bid,
                            unsigned short int tid, spdid\_t spdid);=
      * The semantics of this call depend on the =ops= passed in.
	+ =COS\_BRAND\_CREATE\_HW= and =COS_BRAND_CREATE=: Create a
          brand associated with component =spdid=.  the =HW= specifier
          enables the brand to be wired to an interrupt source.
	+ =COS_BRAND_ADD_THD=: Add a thread =tid= to a brand =bid=, so
          that when that brand is activated, that thread is executed.
          Multiple threads can be associated with a brand, and an
          arbitrary one of them -- that is not already active -- will
          be executed upon brand activation.
    - =int cos\_brand\_upcall(short int thd\_id, short int flags,
                              long arg1, long arg2);=
      * Activate a brand =thd\_id=, and pass the arguments =arg1= and
        =arg2= to the executed thread, unless there are no threads to
        execute in which case the arguments are silently dropped.
        Yes, silently dropped.  In the future, we will drop the
        ability to pass arguments.  This should be restricted so that
        any component _cannot_ activate any brand.  Certainly look for
        future changes.  This call might be deprecated completely so
        that interrupts can activate brands.
    - =int brand\_wait(int thdid);=
      * The current thread attempts to wait for an activation on brand
        =thdid=.  This thread will block unless there is a pending
        activation.
    - =int brand\_wire(long thd\_id, long option, long data);=
      * Associate a specific brand, =thd\_id= with a hardware
        interrupt source.  =option= can be either =COS\_HW\_TIMER= or
        =COS\_HW\_NET=.  In the case of wiring to the networking
        interrupts, =data= is the port being branded to.
    - =int cos\_buff\_mgmt(unsigned short int op, void *addr,
                           unsigned short int len, short int thd\_id);=
      * Currently, _Composite_ does not interface with devices
        directly.  It uses Linux device drivers and simply attempts to
        get the data from the device as early as possible (e.g. after
        IP for networking).  A means is required to move the data from
        the device into components.  That is what this system call
        does.  See
        =src/components/implementation/net\_if/linux\_if/netif.c= for an
        example use.  The semantics of this system call is dependent
        on the value of =op=.
	+ =COS\_BM\_XMIT\_REGION=:  The _Composite_ kernel assumes
          that if it touches user-level regions, those regions must
          never fault.  This option sets up a page that is shared
          between kernel and component that the component can place
          data into, and the kernel can read it out of to transmit.
	+ =COS\_BM\_XMIT=: This call actually does the transfer of
          data.  It parses the transmit region, gets pointers to
          disparate buffers to transmit, does a mapping between them
          and kernel addresses, and copies them to the kernel.  This,
          then, uses gather semantics.  This interface relies on the
          format of the transmit page.  Please see the associated code
          for that format (i.e. see =cos_net_xmit_headers= and
          =gather_item=).
	+ =COS\_BM\_RECV\_RING=: To transfer data from the kernel to
          the components, a ring buffer is set up.  This, again is a
          single page shared between component and kernel that points
          to other page buffers (scatter).  See =ring_buff.c= for more
          details.

*** Mutable protection domains management

    Mutable Protection Domains (MPD) are a novel aspect of
    _Composite_, but they do add complexity.  They enable protection
    domain boundaries between components to be removed and created
    dynamically as the system executes.  In conjunction with
    monitoring information about which communication paths (capability
    invocations) between components are most frequent, this enables
    the system to maximize reliability while meeting
    performance/predictability constraints.

    For details about implementation, interface justifications, and
    applications, please see the MPD paper.

    - =int mpd\_cntl(int operation, spdid\_t composite\_spd, spdid\_t
      composite\_dest);=
      * The operation to be performed is dependent on =operation=.
	+ =COS\_MPD\_SPLIT=: =spd1= is one component in a protection
          domain that includes multiple components, including =spd2=.
          =spd2= is the component that is to be separated and put in a
          separate protection domain from the rest.  This call simply
          "splits" that component out of that protection domain and
          into its own.
	+ =COS\_MPD\_MERGE=: =spd1= and =spd2= are components within
          separate protection domains, and each protection domain can
          contain multiple components.  This call with "merge" those
          two protection domains to remove protection boundaries by
          placing all components in each protection domains into one
          large protection domain containing all components.
    - =void cos\_mpd\_update(void);=
      * Due to invocations operating on stale protection domain
        mappings, we must do garbage collection (of sorts) on
        protection domains.  This call makes that reference counting
        easier and allows components to provide "hints" to expedite
        protection domain changes.  Please see the MPD paper for
        details.  This is complicated.

*** Virtual memory management

    - =int cos\_mmap\_cntl(short int op, short int flags,
	      	           short int dest\_spd, vaddr\_t dest\_addr, long mem\_id);=
      * This system call enables the mapping of physical frames to
        virtual pages in separate components.  When the same physical
        frame is mapped into two components, that page is shared
        memory.  The action performed by this system call is dependent
        on =op=.
	+ =COS\_MMAP\_GRANT=: The physical frame identified by
          =mem\_id= is mapped into virtual address =dest\_addr= of
          component =dest\_spd=.  Physical frames are viewed as an
          array of frames, and =mem\_id= is simply the offset into
          that array.  TODO: This call should be restricted in that
          only one component should be allowed to make it.
	+ =COS\_MMAP\_REVOKE=: Remove the virtual mapping at
          =dest\_addr= in component =dest\_spd=, and return the
          =mem\_id= that was located there.

*** Other functions

    - =int stats(void);=
      * Print out the event counters within the kernel.
    - =int print(char* str, int len);=
      * Print to dmesg the given string.  Don't use this directly.
        Call the print component.

