doc/composite_dev_manual.html

<div id="outline-container-1.3.3" class="outline-4">
<h4 id="sec-1.3.3"><span class="section-number-4">1.3.3</span> Brand management and execution functions </h4>
<div class="outline-text-4" id="text-1.3.3">


<ul>
<li>
<code>int cos_brand_cntl(int ops, unsigned short int bid,                             unsigned short int tid, spdid_t spdid);</code>
<ul>
<li>
The semantics of this call depend on the <code>ops</code> passed in.
<ul>
<li>
<code>COS_BRAND_CREATE_HW</code> and <code>COS_BRAND_CREATE</code>: Create a
brand associated with component <code>spdid</code>.  the <code>HW</code> specifier
enables the brand to be wired to an interrupt source.
</li>
<li>
<code>COS_BRAND_ADD_THD</code>: Add a thread <code>tid</code> to a brand <code>bid</code>, so
that when that brand is activated, that thread is executed.
Multiple threads can be associated with a brand, and an
arbitrary one of them &ndash; that is not already active &ndash; will
be executed upon brand activation.
</li>
</ul>
</li>
</ul>
</li>
<li>
<code>int cos_brand_upcall(short int thd_id, short int flags,                               long arg1, long arg2);</code>
<ul>
<li>
Activate a brand <code>thd_id</code>, and pass the arguments <code>arg1</code> and
<code>arg2</code> to the executed thread, unless there are no threads to
execute in which case the arguments are silently dropped.
Yes, silently dropped.  In the future, we will drop the
ability to pass arguments.  This should be restricted so that
any component <span style="text-decoration:underline;">cannot</span> activate any brand.  Certainly look for
future changes.  This call might be deprecated completely so
that interrupts can activate brands.
</li>
</ul>
</li>
<li>
<code>int brand_wait(int thdid);</code>
<ul>
<li>
The current thread attempts to wait for an activation on brand
<code>thdid</code>.  This thread will block unless there is a pending
activation.
</li>
</ul>
</li>
<li>
<code>int brand_wire(long thd_id, long option, long data);</code>
<ul>
<li>
Associate a specific brand, <code>thd_id</code> with a hardware
interrupt source.  <code>option</code> can be either <code>COS_HW_TIMER</code> or
<code>COS_HW_NET</code>.  In the case of wiring to the networking
interrupts, <code>data</code> is the port being branded to.
</li>
</ul>
</li>
<li>
<code>int cos_buff_mgmt(unsigned short int op, void *addr,                            unsigned short int len, short int thd_id);</code>
<ul>
<li>
Currently, <span style="text-decoration:underline;">Composite</span> does not interface with devices
directly.  It uses Linux device drivers and simply attempts to
get the data from the device as early as possible (e.g. after
IP for networking).  A means is required to move the data from
the device into components.  That is what this system call
does.  See
<code>src/components/implementation/net_if/linux_if/netif.c</code> for an
example use.  The semantics of this system call is dependent
on the value of <code>op</code>.
<ul>
<li>
<code>COS_BM_XMIT_REGION</code>:  The <span style="text-decoration:underline;">Composite</span> kernel assumes
that if it touches user-level regions, those regions must
never fault.  This option sets up a page that is shared
between kernel and component that the component can place
data into, and the kernel can read it out of to transmit.
</li>
<li>
<code>COS_BM_XMIT</code>: This call actually does the transfer of
data.  It parses the transmit region, gets pointers to
disparate buffers to transmit, does a mapping between them
and kernel addresses, and copies them to the kernel.  This,
then, uses gather semantics.  This interface relies on the
format of the transmit page.  Please see the associated code
for that format (i.e. see <code>cos_net_xmit_headers</code> and
<code>gather_item</code>).
</li>
<li>
<code>COS_BM_RECV_RING</code>: To transfer data from the kernel to
the components, a ring buffer is set up.  This, again is a
single page shared between component and kernel that points
to other page buffers (scatter).  See <code>ring_buff.c</code> for more
details.

</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-1.3.4" class="outline-4">
<h4 id="sec-1.3.4"><span class="section-number-4">1.3.4</span> Mutable protection domains management </h4>
<div class="outline-text-4" id="text-1.3.4">


<p>
Mutable Protection Domains (MPD) are a novel aspect of
<span style="text-decoration:underline;">Composite</span>, but they do add complexity.  They enable protection
domain boundaries between components to be removed and created
dynamically as the system executes.  In conjunction with
monitoring information about which communication paths (capability
invocations) between components are most frequent, this enables
the system to maximize reliability while meeting
performance/predictability constraints.
</p>
<p>
For details about implementation, interface justifications, and
applications, please see the MPD paper.
</p>
<ul>
<li>
<code>int mpd_cntl(int operation, spdid_t composite_spd, spdid_t       composite_dest);</code>
<ul>
<li>
The operation to be performed is dependent on <code>operation</code>.
<ul>
<li>
<code>COS_MPD_SPLIT</code>: <code>spd1</code> is one component in a protection
domain that includes multiple components, including <code>spd2</code>.
<code>spd2</code> is the component that is to be separated and put in a
separate protection domain from the rest.  This call simply
"splits" that component out of that protection domain and
into its own.
</li>
<li>
<code>COS_MPD_MERGE</code>: <code>spd1</code> and <code>spd2</code> are components within
separate protection domains, and each protection domain can
contain multiple components.  This call with "merge" those
two protection domains to remove protection boundaries by
placing all components in each protection domains into one
large protection domain containing all components.
</li>
</ul>
</li>
</ul>
</li>
<li>
<code>void cos_mpd_update(void);</code>
<ul>
<li>
Due to invocations operating on stale protection domain
mappings, we must do garbage collection (of sorts) on
protection domains.  This call makes that reference counting
easier and allows components to provide "hints" to expedite
protection domain changes.  Please see the MPD paper for
details.  This is complicated.

</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-1.3.5" class="outline-4">
<h4 id="sec-1.3.5"><span class="section-number-4">1.3.5</span> Virtual memory management </h4>
<div class="outline-text-4" id="text-1.3.5">


<ul>
<li>
<code>int cos_mmap_cntl(short int op, short int flags,                            short int dest_spd, vaddr_t dest_addr, long mem_id);</code>
<ul>
<li>
This system call enables the mapping of physical frames to
virtual pages in separate components.  When the same physical
frame is mapped into two components, that page is shared
memory.  The action performed by this system call is dependent
on <code>op</code>.
<ul>
<li>
<code>COS_MMAP_GRANT</code>: The physical frame identified by
<code>mem_id</code> is mapped into virtual address <code>dest_addr</code> of
component <code>dest_spd</code>.  Physical frames are viewed as an
array of frames, and <code>mem_id</code> is simply the offset into
that array.  TODO: This call should be restricted in that
only one component should be allowed to make it.
</li>
<li>
<code>COS_MMAP_REVOKE</code>: Remove the virtual mapping at
<code>dest_addr</code> in component <code>dest_spd</code>, and return the
<code>mem_id</code> that was located there.

</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-1.3.6" class="outline-4">
<h4 id="sec-1.3.6"><span class="section-number-4">1.3.6</span> Other functions </h4>
<div class="outline-text-4" id="text-1.3.6">


<ul>
<li>
<code>int stats(void);</code>
<ul>
<li>
Print out the event counters within the kernel.
</li>
</ul>
</li>
<li>
<code>int print(char* str, int len);</code>
<ul>
<li>
Print to dmesg the given string.  Don't use this directly.
Call the print component.

</li>
</ul>
</li>
</ul>
</div>

</div>
